"use client";

import css from "./History.module.css";

export default function History() {
  const aboutArray = [
    '3.1. Організаціє є послідовником "Товариства українських правників (1909 - 1931 рр)", яке обʼєднувало фахівців усіх правничих професій, сприяло розвитку суспільних і правничих наук українською мовою та відігравало важливу роль у становленні українського права.',
    '3.2. Організація всебічно розділяє цілі "Товариства Українських Правників" стосовно розвитку філій та представництв в різних регіонах України, за прикладом періоду 1917-1921 років, коли в багатьох містах діяли осередки Товариства українських правників (серед них – Товариство українських правників у Львові, Києві, кожне з яких виконувало важливу роль у своїх історичних умовах).',
    "3.3 Організація за прикладом Товариства Українських Правників - вважає доцільним у своїй діяльності об`єднання правників усіх професій.",
    "3.4 Організація спонукає розвитку української ділової мови, за прикладом Українських правничих організацій 1917-1921 років, таких як - переклад австрійських кодексів українською мовою.",
    "3.5 Організація вважає за потрібне розвиток правничих і соціальних наук українською мовою як у теорії, так і на практиці (за прикладом Проведення Першого зʼїзду українських правників у Львові 1914 року).",
    "3.6 Організація ставить своїм основоположним завданням продовжувати діяльність та слідувати цілям Товариства українських правників, а саме:",
    "3.6.1 Сприяння становленню та розвитку українського права",
    "3.6.2 Висвітлення процесів українізації правової системи",
    "3.6.3 Становлення української правничої мови",
    "3.6.4 Видання української правознавчої літератури, за прикладом номерів журналу «Правник» у 1918 році, який містив статті цивільного та кримінального права, матеріали з правничої термінології.",
    "3.6.5 Засновувати та нологоджувати стосунки з міжнародними осередками для імігрантів з України, як приклад ТУП в Празі 1920 року.",
    "3.7 Організація правонаслідує у своїй роботі - діяльність УПТ в Києві (1917 р.) та Київського юридичного товариства, заснованого 1917 року за підтримки Центральної ради в УНР. Поділяє та просуває всі їхні проукраїнські ідеї та цілі.",
  ];

  return (
    <section className={css.aboutSection}>
      <h2 className={css.aboutTitle}>Історія</h2>
      <p className={css.aboutSubtitle}>Історична роль та місія Організації</p>
      <ul className={css.itemsList}>
        {aboutArray.map((item) => (
          <li className={css.item}>{item}</li>
        ))}
      </ul>
    </section>
  );
}
